src/InformationRegisters/ar_ДействияАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_ДействияАгента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_ИмяИнструмента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АргументыJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_RiskLevel</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_УровеньРиска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ResultRef</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ApprovedBy</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ApprovedAt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ДлительностьМС</Name>
					<Comment>Длительность вызова tool в миллисекундах: от начала выполнения реализации до возврата результата или исключения. Заполняется ВСЕГДА, независимо от флага ar_ЗамерПроизводительности и наличия подсистемы БСП "Оценка производительности". 0 означает "не измерено" (например запись создана не из ar_ИнструментыДиспетчер.Вызвать). PERF-04.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЗавершёнСОшибкой</Name>
					<Comment>Вызов завершился ошибкой: исключение реализации либо observation с ключом "error". Нужен для статистики PERF-05 - сам текст observation в регистре не хранится, восстановить признак постфактум нельзя.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_RunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ar_Sequence</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ar_СтатусЗапуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_СтатусЗапуска</Name>
			<Comment>Жизненный цикл запуска агента: created -&gt; running -&gt; paused/completed/failed/...</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Created</Name>
					<Comment>Запись создана, фоновое задание ещё не стартовало</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Running</Name>
					<Comment>Фоновое задание активно, loop работает</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PausedForApproval</Name>
					<Comment>Loop приостановлен, ждёт решения оператора в очереди подтверждений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PausedForInput</Name>
					<Comment>Loop приостановлен, агент ожидает ответа оператора на вопрос ask_user</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Completed</Name>
					<Comment>Финальный статус: агент выполнил задачу без ошибок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Failed</Name>
					<Comment>Финальный статус: необработанное исключение или сбой LLM</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Cancelled</Name>
					<Comment>Финальный статус: отменён пользователем вручную</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MaxStepsReached</Name>
					<Comment>Финальный статус: превышен МаксШагов агента</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DeniedGlobally</Name>
					<Comment>Финальный статус: пользователь не входит в роль агента</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Interrupted</Name>
					<Comment>Финальный статус: heartbeat пропал дольше порога, сервер упал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FailedIncompatibleState</Name>
					<Comment>Финальный статус: StateSnapshot несовместим с текущей версией ядра</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PausedForEvent</Name>
					<Comment>PLAN-10: Loop приостановлен, ждёт наступления внешнего события (tool wait_for_event, PLAN-11) или истечения дедлайна ar_ОжиданиеДо (PLAN-13). Снимается ar_ОбработчикПодписок (push, PLAN-12) или регламентным заданием проверки дедлайна (PLAN-13).</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonForms/ar_КонсольАгентов/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общая форма ar_КонсольАгентов («Консоль агентов» / «Agents console») — CONS-04.
//
// Главный экран оператора: список запусков (штатная таблица формы на
// реквизите-ТаблицаЗначений, НЕ HTML-поле — план §4), панель отбора, сводка,
// строка здоровья планировщика. ВСЕ данные форма получает ИСКЛЮЧИТЕЛЬНО через
// ar_КонсольДанные (CONS-03) — собственных запросов к ar_Запуски/
// ar_ОчередьApproval в форме нет, иначе обходится встроенный фильтр
// безопасности CONS-03 («неадмин не видит чужих запусков», D13).
//
// ДВА НЕЗАВИСИМЫХ ТАЙМЕРА (см. таблицу в спеке, прецедент ar_ПросмотрЗапуска
// UI-12):
//  * ОбновитьСписок      — 60 сек, полный цикл (список + сводка + здоровье),
//    обращение к серверу. Не идёт, если снят флажок АвтообновлениеВключено.
//  * ПересчитатьЖивость  — несколько секунд (тот же интервал, что и в
//    ar_ПросмотрЗапуска), чистый клиентский пересчёт колонки "Живость" по уже
//    загруженным в ТЗ данным (LastHeartbeat), без обращения к серверу.
//
// Быстрые режимы ("Работают"/"ТребуютВнимания"/Все) + отбор (период, агент,
// ответственный, статус[ы], триггер, "только с ошибками", "только
// автономные") передаются в ar_КонсольДанные как структура Отбор - без
// собственной интерпретации на сервере формы сверх сборки этой структуры.
//
// Известное ограничение (см. спеку, "Риски"): ar_Триггер - произвольная
// строка (manual/schedule/mention/subscription/http/dialog), список в
// ChoiceList поля ОтборТриггер жёстко зашит этими 6 значениями - новый
// триггер, если появится, останется невидимым для отбора (хотя будет виден в
// колонке списка).
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	// Период по умолчанию - последние 3 дня (решение спеки, п.1 "Открытие
	// формы"); переинициализируется при каждом открытии, в отличие от
	// остальных полей отбора (сохраняются между сеансами - см. SavedData в
	// Form.xml).
	ДнейПоУмолчанию = 3;
	ОтборПериодПо = КонецДня(ТекущаяДатаСеанса());
	ОтборПериодС = НачалоДня(ТекущаяДатаСеанса() - ДнейПоУмолчанию * 24 * 60 * 60);

	Если ПустаяСтрока(ОтборРежимБыстрый) Тогда
		ОтборРежимБыстрый = "Работают";
	КонецЕсли;

	АвтообновлениеВключено = Истина;

	ЗаполнитьChoiceListТриггера();
	ИнициализироватьСтатусыОтбораНаСервере();

	HeartbeatПорогСекКэш = ar_Константы.HeartbeatПорогСек();

	// Замечание оркестратора (живой прогон 0.1.0.300): клиентская процедура
	// ПересчитатьЖивость не имеет доступа к серверному менеджеру
	// "Перечисления" (клиентское приложение отвергает его с "Variable is not
	// defined"). Значение перечисления Running получаем один раз здесь, на
	// сервере, и кэшируем в реквизит формы - тот же приём, что уже применён
	// для HeartbeatПорогСекКэш строкой выше. Сами значения перечислений -
	// обычные данные (как и Строка.Статус, пришедший в ТЗ с сервера), клиенту
	// запрещено только обращение к менеджеру для ИХ ПОЛУЧЕНИЯ.
	СтатусRunningКэш = Перечисления.ar_СтатусЗапуска.Running;

	// CONS-05: та же причина, что и у СтатусRunningКэш выше - клиентским
	// обработчикам ОбновитьДоступностьКоманд/СтатусДопускаетОстановку нужно
	// сравнение статуса строки со значениями перечисления, а обращение к
	// менеджеру "Перечисления" с клиента запрещено платформой.
	СтатусCreatedКэш = Перечисления.ar_СтатусЗапуска.Created;
	СтатусInterruptedКэш = Перечисления.ar_СтатусЗапуска.Interrupted;
	СтатусPausedForApprovalКэш = Перечисления.ar_СтатусЗапуска.PausedForApproval;
	СтатусPausedForInputКэш = Перечисления.ar_СтатусЗапуска.PausedForInput;

	ОбновитьВсёНаСервере();

КонецПроцедуры

// UI-12/CONS-04: подключает оба независимых таймера (см. шапку модуля).
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если АвтообновлениеВключено Тогда
		ПодключитьОбработчикОжидания("ОбновитьСписокПоТаймеру", ИнтервалАвтообновленияСек(), Ложь);
	КонецЕсли;

	ПодключитьОбработчикОжидания("ПересчитатьЖивость", ИнтервалЖивостиСек(), Ложь);

	// CONS-05: начальное состояние кнопок "Остановить"/"Возобновить" для
	// строки, выбранной платформой по умолчанию при открытии формы (список уже
	// заполнен - ПриСозданииНаСервере вызвала ОбновитьВсёНаСервере напрямую,
	// без клиентского ОбновитьВсё, поэтому доступность не пересчитана).
	ОбновитьДоступностьКоманд();

КонецПроцедуры

// UI-12/CONS-04: явно снимает оба обработчика ожидания при закрытии формы
// (та же практика, что и в ar_ПросмотрЗапуска - платформа отключает их сама
// при закрытии формы, но явный вызов - принятая в проекте защитная мера).
//
&НаКлиенте
Процедура ПриЗакрытии()

	ОтключитьОбработчикОжидания("ОбновитьСписокПоТаймеру");
	ОтключитьОбработчикОжидания("ПересчитатьЖивость");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ОтборПериодСПриИзменении(Элемент)
	ОбновитьВсё();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодПоПриИзменении(Элемент)
	ОбновитьВсё();
КонецПроцедуры

&НаКлиенте
Процедура ОтборАгентРефПриИзменении(Элемент)
	ОбновитьВсё();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПользовательРефПриИзменении(Элемент)
	ОбновитьВсё();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТриггерПриИзменении(Элемент)
	ОбновитьВсё();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТолькоСОшибкамиПриИзменении(Элемент)
	ОбновитьВсё();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТолькоАвтономныеПриИзменении(Элемент)
	ОбновитьВсё();
КонецПроцедуры

// Множественный выбор статуса (план §2.2) - флажок в строке таблицы
// СтатусыОтбора. Обновление списка сразу после отметки/снятия флажка -
// поведение симметрично остальным полям отбора.
//
&НаКлиенте
Процедура СтатусыОтбораОтмеченоПриИзменении(Элемент)
	ОбновитьВсё();
КонецПроцедуры

&НаКлиенте
Процедура АвтообновлениеВключеноПриИзменении(Элемент)

	Если АвтообновлениеВключено Тогда
		ПодключитьОбработчикОжидания("ОбновитьСписокПоТаймеру", ИнтервалАвтообновленияСек(), Ложь);
	Иначе
		ОтключитьОбработчикОжидания("ОбновитьСписокПоТаймеру");
	КонецЕсли;

КонецПроцедуры

// CONS-05: пересчитывает доступность/видимость "Остановить"/"Возобновить" при
// переключении строки (без ожидания следующего срабатывания таймера
// ОбновитьСписокПоТаймеру) - см. ОбновитьДоступностьКоманд.
//
&НаКлиенте
Процедура СписокЗапусковПриАктивизацииСтроки(Элемент)
	ОбновитьДоступностьКоманд();
КонецПроцедуры

// CONS-05: двойной клик по строке списка - то же действие, что кнопка
// "Открыть" (см. ОткрытьЗапускВыполнить). Платформенное событие Selection
// табличного поля на реквизите-ТЗ (не связанном с объектом-владельцем) -
// СтандартнаяОбработка сбрасывается, иначе платформа попытается открыть
// строку как элемент справочника/документа и ничего не найдёт.
//
&НаКлиенте
Процедура СписокЗапусковВыборСтроки(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьВыбранныйЗапуск();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Кнопка "Обновить" - работает независимо от флажка АвтообновлениеВключено
// (D7 спеки).
//
&НаКлиенте
Процедура ОбновитьВыполнить(Команда)
	ОбновитьВсё();
КонецПроцедуры

// Быстрые режимы (D4) - переключают состав списка немедленно, не дожидаясь
// минутного таймера.
//
&НаКлиенте
Процедура УстановитьРежимРаботаютВыполнить(Команда)
	ОтборРежимБыстрый = "Работают";
	ОбновитьВсё();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимТребуютВниманияВыполнить(Команда)
	ОтборРежимБыстрый = "ТребуютВнимания";
	ОбновитьВсё();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимВсеВыполнить(Команда)
	ОтборРежимБыстрый = "";
	ОбновитьВсё();
КонецПроцедуры

// CONS-05: "Открыть" - открывает Run Viewer (ОбщаяФорма.ar_ПросмотрЗапуска) по
// RunId текущей строки. Тот же обработчик используется двойным кликом
// (СписокЗапусковВыборСтроки) - см. ОткрытьВыбранныйЗапуск.
//
&НаКлиенте
Процедура ОткрытьЗапускВыполнить(Команда)
	ОткрытьВыбранныйЗапуск();
КонецПроцедуры

// CONS-05: единая точка guard'а "строка выбрана, RunId заполнен" - до
// рефакторинга это условие дублировалось в каждой из 6 команд отдельно (см.
// AI-аудит check_1c_code при разработке: "Дублирование кода проверки
// ТекущиеДанные"). Возвращает Неопределено и сама показывает предупреждение,
// если условие не выполнено - вызывающая команда просто делает Возврат.
//
// Параметры:
//   ТребоватьRunId - Булево - Истина, если команде нужен заполненный RunId
//                    (большинство команд); Ложь - достаточно самой строки
//                    (ОткрытьАгентаВыполнить/ОткрытьПользователяВыполнить,
//                    у которых свои проверки на АгентРеф/ПользовательРеф).
//
// Возвращаемое значение:
//   Строка данных ТЗ СписокЗапусков либо Неопределено.
//
&НаКлиенте
Функция ТекущаяСтрокаСписка(Знач ТребоватьRunId = Истина)

	ТекущиеДанные = Элементы.СписокЗапусков.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите строку списка.'; en = 'Select a row in the list.'"));
		Возврат Неопределено;
	КонецЕсли;

	Если ТребоватьRunId И ПустаяСтрока(ТекущиеДанные.RunId) Тогда
		ПоказатьПредупреждение(, НСтр(
			"ru = 'У выбранной строки не заполнен RunId.'; en = 'The selected row has no RunId.'"));
		Возврат Неопределено;
	КонецЕсли;

	Возврат ТекущиеДанные;

КонецФункции

// D1/D9: паттерн 1-в-1 из ar_ОчередьПодтверждений.ОткрытьRunViewer - форма
// Run Viewer может быть не установлена в базе, Попытка/Исключение защищает
// от падения при открытии.
//
&НаКлиенте
Процедура ОткрытьВыбранныйЗапуск()

	ТекущиеДанные = ТекущаяСтрокаСписка();
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		ОткрытьФорму("ОбщаяФорма.ar_ПросмотрЗапуска", Новый Структура("RunId", ТекущиеДанные.RunId), ЭтотОбъект);
	Исключение
		ПоказатьПредупреждение(, НСтр("ru='Форма Run Viewer недоступна.'; en='The Run Viewer form is unavailable.'"));
	КонецПопытки;

КонецПроцедуры

// D2/D9: "Остановить" - подтверждение (RT-06: остановка не гарантирует
// немедленную остановку процесса) + серверный вызов ar_RuntimeЗапуск.
// Отменить(RunId). После вызова список перечитывается через ОбновитьВсё -
// платформа не гарантирует мгновенную смену статуса, локальным
// присваиванием колонки не подменяем (см. спеку, "Поведение", п.2).
//
&НаКлиенте
Асинх Процедура ОстановитьЗапускВыполнить(Команда)

	ТекущиеДанные = ТекущаяСтрокаСписка();
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	RunId = ТекущиеДанные.RunId;

	ТекстВопроса = НСтр(
		"ru = 'Остановить запуск?
		|Остановка не гарантирует немедленную остановку процесса - активный шаг
		|может завершиться до того, как запуск фактически прекратится.
		|Продолжить?';
		|en = 'Stop the run?
		|Stopping does not guarantee the process stops immediately - the active
		|step may finish before the run actually terminates.
		|Continue?'");

	Ответ = Ждать ВопросАсинх(
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет,
		,
		КодВозвратаДиалога.Нет,
		НСтр("ru = 'Остановка запуска'; en = 'Stop run'"));

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	АктивноеЗаданиеНайдено = ОтменитьЗапускНаСервере(RunId);

	Если АктивноеЗаданиеНайдено Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Запрошена остановка'; en = 'Stop requested'"));
	Иначе
		ПоказатьОповещениеПользователя(НСтр(
			"ru = 'Активное задание не найдено, запуск уже завершён'; en = 'No active job found, the run has already finished'"));
	КонецЕсли;

	ОбновитьВсё();

КонецПроцедуры

&НаСервере
Функция ОтменитьЗапускНаСервере(Знач RunId)
	Возврат ar_RuntimeЗапуск.Отменить(RunId);
КонецФункции

// D3/D9: "Возобновить" - активна только для Interrupted+ЕстьСнимок=Истина
// (см. ОбновитьДоступностьКоманд). Само нажатие защищено тем же guard'ом на
// случай прямого вызова команды (например, с клавиатуры) в обход видимости
// кнопки - тот же паттерн, что ar_ПоказатьPrompt в ar_ПросмотрЗапуска.
//
&НаКлиенте
Асинх Процедура ВозобновитьЗапускВыполнить(Команда)

	ТекущиеДанные = ТекущаяСтрокаСписка();
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	RunId = ТекущиеДанные.RunId;

	ТекстВопроса = НСтр(
		"ru = 'Возобновить прерванный запуск?
		|Если запуск был прерван во время выполнения шага, повторный запуск
		|может привести к повторному выполнению уже начатых мутирующих действий.
		|Продолжить?';
		|en = 'Resume the interrupted run?
		|If the run was interrupted during a step, resuming may cause already
		|started mutating actions to run again.
		|Continue?'");

	Ответ = Ждать ВопросАсинх(
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет,
		,
		КодВозвратаДиалога.Нет,
		НСтр("ru = 'Возобновление запуска'; en = 'Resume run'"));

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	Результат = ВозобновитьЗапускНаСервере(RunId);

	Если Результат.Успех Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Запуск возобновлён'; en = 'Run resumed'"));
	Иначе
		// CONS-05: тот же общий текст причины отказа, что и ar_ПросмотрЗапуска
		// (см. ar_Утилиты.ТекстПричиныОтказаResume) - не дублируем формулировки.
		Ждать ПредупреждениеАсинх(ar_Утилиты.ТекстПричиныОтказаResume(Результат.Причина));
	КонецЕсли;

	ОбновитьВсё();

КонецПроцедуры

&НаСервере
Функция ВозобновитьЗапускНаСервере(Знач RunId)
	Возврат ar_RuntimeЗапуск.Возобновить(RunId);
КонецФункции

// D4: переход в очередь подтверждений, отфильтрованную по RunId текущей
// строки (CONS-05 доработка ar_ОчередьПодтверждений - см. спеку, "Поведение",
// п.4). Доступна всегда (не только когда ОжидаютApproval > 0) - оператор
// может убедиться, что очередь по этому запуску действительно пуста.
//
&НаКлиенте
Процедура ОткрытьОчередьПодтвержденийВыполнить(Команда)

	ТекущиеДанные = ТекущаяСтрокаСписка();
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		ОткрытьФорму("ОбщаяФорма.ar_ОчередьПодтверждений", Новый Структура("RunId", ТекущиеДанные.RunId), ЭтотОбъект);
	Исключение
		ПоказатьПредупреждение(, НСтр(
			"ru='Форма очереди подтверждений недоступна.'; en='The approval queue form is unavailable.'"));
	КонецПопытки;

КонецПроцедуры

// D5: "Открыть агента" - платформенный ПоказатьЗначение, асинхронный аналог
// устаревшего ОткрытьЗначение. Пустая ссылка - не пытаемся открыть, показываем
// предупреждение (спека, "Поведение", п.5).
//
&НаКлиенте
Процедура ОткрытьАгентаВыполнить(Команда)

	ТекущиеДанные = ТекущаяСтрокаСписка(Ложь);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекущиеДанные.АгентРеф) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'У выбранной строки не указан агент.'; en = 'The selected row has no agent.'"));
		Возврат;
	КонецЕсли;

	ПоказатьЗначение(, ТекущиеДанные.АгентРеф);

КонецПроцедуры

// D5: "Открыть пользователя" - тот же паттерн, что ОткрытьАгентаВыполнить.
//
&НаКлиенте
Процедура ОткрытьПользователяВыполнить(Команда)

	ТекущиеДанные = ТекущаяСтрокаСписка(Ложь);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекущиеДанные.ПользовательРеф) Тогда
		ПоказатьПредупреждение(, НСтр(
			"ru = 'У выбранной строки не указан ответственный пользователь.'; en = 'The selected row has no responsible user.'"));
		Возврат;
	КонецЕсли;

	ПоказатьЗначение(, ТекущиеДанные.ПользовательРеф);

КонецПроцедуры

// D6: "Показать созданные объекты" - читает РегистрСведений.ar_ДействияАгента
// по RunId (не ar_Запуски, D7 не нарушается), разыменовывает каждый непустой
// ar_ResultRef через ar_Утилиты.ОбъектИзНавигационнойСсылки. 0 объектов -
// предупреждение; 1 - открыть сразу; больше одного - открыть все
// последовательно (временное решение до CONS-06, см. спеку "Риски").
//
&НаКлиенте
Процедура ПоказатьСозданныеОбъектыВыполнить(Команда)

	ТекущиеДанные = ТекущаяСтрокаСписка();
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Объекты = СозданныеОбъектыЗапускаНаСервере(ТекущиеДанные.RunId);

	Если Объекты.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр(
			"ru = 'По этому запуску нет зафиксированных созданных объектов.';
			|en = 'No created objects are recorded for this run.'"));
		Возврат;
	КонецЕсли;

	Для Каждого Объект Из Объекты Цикл
		ПоказатьЗначение(, Объект);
	КонецЦикла;

КонецПроцедуры

// Читает непустые ar_ResultRef запуска и разыменовывает их в объекты ИБ.
// Ссылки, которые не удалось разыменовать (ar_Утилиты.
// ОбъектИзНавигационнойСсылки вернула Неопределено), пропускаются - функция
// сама пишет предупреждение в лог, повторно логировать здесь не нужно.
//
// Параметры:
//   RunId - Строка - идентификатор запуска.
//
// Возвращаемое значение:
//   Массив - объекты ИБ (могут быть разных типов), без Неопределено.
//
&НаСервере
Функция СозданныеОбъектыЗапускаНаСервере(Знач RunId)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Действия.ar_ResultRef КАК ResultRef
		|ИЗ
		|	РегистрСведений.ar_ДействияАгента КАК Действия
		|ГДЕ
		|	Действия.ar_RunId = &RunId
		|	И Действия.ar_ResultRef <> """"
		|УПОРЯДОЧИТЬ ПО
		|	Действия.ar_Sequence";
	Запрос.УстановитьПараметр("RunId", RunId);

	Результат = Новый Массив;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = ar_Утилиты.ОбъектИзНавигационнойСсылки("" + Выборка.ResultRef);
		Если Объект <> Неопределено Тогда
			Результат.Добавить(Объект);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// UI-12/CONS-04: интервал 60-секундного автообновления списка (решение 5
// спеки - число зафиксировано планом, отдельная константа не заводится).
//
&НаКлиенте
Функция ИнтервалАвтообновленияСек()
	Возврат 60;
КонецФункции

// UI-12/CONS-04: интервал клиентского пересчёта живости - то же число, что и
// в ar_ПросмотрЗапуска (5 сек), ради единообразия восприятия (см. спеку,
// "Два независимых таймера").
//
&НаКлиенте
Функция ИнтервалЖивостиСек()
	Возврат 5;
КонецФункции

// Обработчик 60-секундного таймера. Приостанавливает обновление, если
// активный отбор не содержит ни одного незавершённого статуса и режим не
// "Работают" (D7/п.5 "Обновление списка" спеки) - дёргать сервер раз в минуту
// незачем, если оператор листает архив.
//
&НаКлиенте
Процедура ОбновитьСписокПоТаймеру()

	Если Не АвтообновлениеВключено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЦелесообразноАвтообновление() Тогда
		Возврат;
	КонецЕсли;

	ОбновитьВсё();

КонецПроцедуры

// Целесообразность автообновления по таймеру (не влияет на ручную кнопку
// "Обновить", которая работает всегда) - см. п.5 "Обновление списка" спеки.
//
&НаКлиенте
Функция ЦелесообразноАвтообновление()

	Если ОтборРежимБыстрый = "Работают" Тогда
		Возврат Истина;
	КонецЕсли;

	Для Каждого СтрокаСтатуса Из СтатусыОтбора Цикл
		Если СтрокаСтатуса.Отмечено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	// Ни одного отмеченного статуса и режим не "Работают" - список
	// потенциально статичен (архив), тревожить сервер незачем.
	Возврат ОтборРежимБыстрый = "Работают";

КонецФункции

// CONS-05: пересчитывает доступность команд управления строкой ("Остановить"/
// "Возобновить") после каждого обновления списка - вызывается и из
// ОбновитьВсё (после отработки таймера/кнопки "Обновить"), и сразу после
// Остановить/Возобновить конкретной строки (см. ОстановитьЗапускВыполнить/
// ВозобновитьЗапускВыполнить).
//
&НаКлиенте
Процедура ОбновитьДоступностьКоманд()

	ТекущиеДанные = Элементы.СписокЗапусков.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.КнопкаОстановитьЗапуск.Доступность = Ложь;
		Элементы.КнопкаВозобновитьЗапуск.Доступность = Ложь;
		Возврат;
	КонецЕсли;

	Элементы.КнопкаОстановитьЗапуск.Доступность = СтатусДопускаетОстановку(ТекущиеДанные.Статус);
	Элементы.КнопкаВозобновитьЗапуск.Видимость = (ТекущиеДанные.Статус = СтатусInterruptedКэш);
	Элементы.КнопкаВозобновитьЗапуск.Доступность = (ТекущиеДанные.Статус = СтатусInterruptedКэш)
		И ТекущиеДанные.ЕстьСнимок;

КонецПроцедуры

// CONS-05: сравнение статуса строки с допустимыми для "Остановить" статусами -
// ТОЛЬКО через кэш-реквизиты формы (СтатусRunningКэш и т.д.), заполненные на
// сервере в ПриСозданииНаСервере. Прямое обращение к "Перечисления.*" из
// клиентского контекста запрещено платформой (см. шапку модуля, опыт CONS-04:
// "Variable is not defined").
//
// Параметры:
//   Статус - ПеречислениеСсылка.ar_СтатусЗапуска - статус строки списка.
//
// Возвращаемое значение:
//   Булево - Истина, если для этого статуса остановка запуска осмысленна.
//
&НаКлиенте
Функция СтатусДопускаетОстановку(Знач Статус)

	Возврат (Статус = СтатусRunningКэш)
		Или (Статус = СтатусCreatedКэш)
		Или (Статус = СтатусPausedForApprovalКэш)
		Или (Статус = СтатусPausedForInputКэш);

КонецФункции

// Полный цикл обновления: список + сводка + здоровье планировщика, одним
// клиент-серверным вызовом. Защита от повторного входа (ИдётОбновление) -
// на случай, если пользователь жмёт "Обновить" вручную посреди уже идущего
// вызова (см. спеку, "Наложение друг на друга").
//
&НаКлиенте
Процедура ОбновитьВсё()

	Если ИдётОбновление Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрокаRunId = "";
	Если Элементы.СписокЗапусков.ТекущиеДанные <> Неопределено Тогда
		ТекущаяСтрокаRunId = Элементы.СписокЗапусков.ТекущиеДанные.RunId;
	КонецЕсли;

	// ОбновитьВсёНаСервере сама оборачивает вызовы ar_КонсольДанные в
	// Попытка/Исключение и показывает сообщение через
	// ОбщегоНазначенияКлиентСервер.СообщитьПользователю (см. спеку, "Ошибки и
	// пустые состояния") - клиентский Попытка/Исключение здесь нужен только
	// как защита от того, чтобы ИдётОбновление не застряло в Истина при
	// непредвиденном сбое самого серверного вызова (не бизнес-ошибке).
	ИдётОбновление = Истина;
	Попытка
		ОбновитьВсёНаСервере();
	Исключение
		ИдётОбновление = Ложь;
		ВосстановитьТекущуюСтроку(ТекущаяСтрокаRunId);
		Возврат;
	КонецПопытки;
	ИдётОбновление = Ложь;

	ВосстановитьТекущуюСтроку(ТекущаяСтрокаRunId);
	ОбновитьДоступностьКоманд();

КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьТекущуюСтроку(Знач RunId)

	Если ПустаяСтрока(RunId) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Строка Из СписокЗапусков Цикл
		Если Строка.RunId = RunId Тогда
			Элементы.СписокЗапусков.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
			Возврат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Серверная часть полного цикла обновления - вызывается и при открытии формы
// (ПриСозданииНаСервере), и с клиента (ОбновитьВсё). Оборачивает вызовы
// ar_КонсольДанные в Попытка/Исключение (см. спеку, "Ошибки и пустые
// состояния") - сбой сервиса не должен ронять форму.
//
&НаСервере
Процедура ОбновитьВсёНаСервере()

	Попытка
		Отбор = СобратьОтбор();
		ОбновитьСписокЗапусковНаСервере(Отбор);
		ОбновитьСводкуНаСервере(Отбор);
		ОбновитьЗдоровьеНаСервере();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

// Собирает структуру Отбор из реквизитов панели формы - ровно те поля,
// которые понимает расширённый (CONS-04) ar_КонсольДанные.ДобавитьУсловияОтбора.
//
// Возвращаемое значение:
//   Структура - см. докстроку ar_КонсольДанные.СписокЗапусков.
//
&НаСервере
Функция СобратьОтбор()

	Отбор = Новый Структура;

	Если Не ПустаяСтрока(ОтборРежимБыстрый) Тогда
		Отбор.Вставить("Режим", ОтборРежимБыстрый);
	КонецЕсли;

	Если ЗначениеЗаполнено(ОтборПериодС) И ЗначениеЗаполнено(ОтборПериодПо) Тогда
		Отбор.Вставить("ПериодС", ОтборПериодС);
		Отбор.Вставить("ПериодПо", КонецДня(ОтборПериодПо));
	КонецЕсли;

	Если ЗначениеЗаполнено(ОтборАгентРеф) Тогда
		Отбор.Вставить("АгентРеф", ОтборАгентРеф);
	КонецЕсли;

	Если ЗначениеЗаполнено(ОтборПользовательРеф) Тогда
		Отбор.Вставить("ПользовательРеф", ОтборПользовательРеф);
	КонецЕсли;

	Если Не ПустаяСтрока(ОтборТриггер) Тогда
		Отбор.Вставить("Триггер", ОтборТриггер);
	КонецЕсли;

	Если ОтборТолькоСОшибками Тогда
		Отбор.Вставить("ТолькоСОшибками", Истина);
	КонецЕсли;

	Если ОтборТолькоАвтономные Тогда
		Отбор.Вставить("ТолькоАвтономные", Истина);
	КонецЕсли;

	СтатусыОтмеченные = Новый Массив;
	Для Каждого СтрокаСтатуса Из СтатусыОтбора Цикл
		Если СтрокаСтатуса.Отмечено Тогда
			СтатусыОтмеченные.Добавить(СтрокаСтатуса.Статус);
		КонецЕсли;
	КонецЦикла;
	Если СтатусыОтмеченные.Количество() > 0 Тогда
		Отбор.Вставить("СтатусыРеф", СтатусыОтмеченные);
	КонецЕсли;

	Возврат Отбор;

КонецФункции

// Обновляет реквизит-ТЗ СписокЗапусков из ar_КонсольДанные.СписокЗапусков,
// смёрженного со счётчиком ожидающих approval (ar_КонсольДанные.
// СчётчикОжидающихApproval) по RunId. Колонки ТокеновВход/ТокеновВыход/
// СтоимостьРуб из ответа модуля НЕ копируются в ТЗ формы (D6 - "без стоимости
// и токенов", колонок физически нет).
//
&НаСервере
Процедура ОбновитьСписокЗапусковНаСервере(Знач Отбор)

	Список = ar_КонсольДанные.СписокЗапусков(Отбор);
	СчётчикApproval = ar_КонсольДанные.СчётчикОжидающихApproval();

	СоответствиеApproval = Новый Соответствие;
	Для Каждого СтрокаApproval Из СчётчикApproval Цикл
		СоответствиеApproval.Вставить(СтрокаApproval.RunId, СтрокаApproval.Количество);
	КонецЦикла;

	СписокЗапусков.Очистить();
	Для Каждого Строка Из Список Цикл

		НоваяСтрока = СписокЗапусков.Добавить();
		НоваяСтрока.RunId = Строка.RunId;
		НоваяСтрока.Статус = Строка.Статус;
		НоваяСтрока.АгентРеф = Строка.АгентРеф;
		НоваяСтрока.ПредставлениеАгента = Строка.ПредставлениеАгента;
		НоваяСтрока.ПользовательРеф = Строка.ПользовательРеф;
		НоваяСтрока.ПредставлениеПользователя = Строка.ПредставлениеПользователя;
		НоваяСтрока.СтартовалВ = Строка.СтартовалВ;
		НоваяСтрока.ЗавершенВ = Строка.ЗавершенВ;
		НоваяСтрока.Триггер = Строка.Триггер;
		НоваяСтрока.ШаговВсего = Строка.ШаговВсего;
		НоваяСтрока.LastHeartbeat = Строка.LastHeartbeat;
		НоваяСтрока.РодительскийRunId = Строка.РодительскийRunId;
		НоваяСтрока.ЕстьСнимок = Строка.ЕстьСнимок;

		Найдено = СоответствиеApproval.Получить(Строка.RunId);
		НоваяСтрока.ОжидаютApproval = ?(Найдено = Неопределено, 0, Найдено);

		НоваяСтрока.ПредставлениеДлительности = ПредставлениеДлительности(Строка.СтартовалВ, Строка.ЗавершенВ);
		НоваяСтрока.ГруппаСтатуса = ГруппаСтатуса(Строка.Статус);
		ЗаполнитьЖивостьСтроки(НоваяСтрока, Строка.Статус, Строка.LastHeartbeat, ТекущаяДатаСеанса());

	КонецЦикла;

КонецПроцедуры

// D5: относит статус запуска к одной из четырёх визуальных групп для
// ConditionalAppearance формы (Form.xml, СписокЗапусков.ГруппаСтатуса).
//
// Возвращаемое значение:
//   Строка - "Обычный" / "ЖдётОператора" / "Ошибка" / "Завершено".
//
&НаСервереБезКонтекста
Функция ГруппаСтатуса(Знач Статус)

	Если Статус = Перечисления.ar_СтатусЗапуска.PausedForApproval
		Или Статус = Перечисления.ar_СтатусЗапуска.PausedForInput Тогда
		Возврат "ЖдётОператора";
	ИначеЕсли Статус = Перечисления.ar_СтатусЗапуска.Failed
		Или Статус = Перечисления.ar_СтатусЗапуска.Interrupted
		Или Статус = Перечисления.ar_СтатусЗапуска.MaxStepsReached Тогда
		Возврат "Ошибка";
	ИначеЕсли Статус = Перечисления.ar_СтатусЗапуска.Completed
		Или Статус = Перечисления.ar_СтатусЗапуска.Cancelled
		Или Статус = Перечисления.ar_СтатусЗапуска.DeniedGlobally
		Или Статус = Перечисления.ar_СтатусЗапуска.FailedIncompatibleState Тогда
		Возврат "Завершено";
	Иначе
		Возврат "Обычный";
	КонецЕсли;

КонецФункции

// D8: заполняет ЖивостьТекст/ЖивостьПодозрениеНаЗависание для одной строки ТЗ
// на момент серверного обновления списка. Дальнейший клиентский пересчёт
// (ПересчитатьЖивость) обновляет те же колонки без обращения к серверу.
//
&НаСервереБезКонтекста
Процедура ЗаполнитьЖивостьСтроки(Знач СтрокаТЗ, Знач Статус, Знач LastHeartbeat, Знач Текущая)

	Если Статус <> Перечисления.ar_СтатусЗапуска.Running Или Не ЗначениеЗаполнено(LastHeartbeat) Тогда
		СтрокаТЗ.ЖивостьТекст = "";
		СтрокаТЗ.ЖивостьПодозрениеНаЗависание = Ложь;
		Возврат;
	КонецЕсли;

	ВозрастСек = Цел(Текущая - LastHeartbeat);
	Если ВозрастСек < 0 Тогда
		ВозрастСек = 0;
	КонецЕсли;

	СтрокаТЗ.ЖивостьТекст = СтрШаблон(НСтр("ru = '%1 сек назад'; en = '%1 sec ago'"),
		Формат(ВозрастСек, "ЧГ=0; ЧДЦ=0; ЧН=0"));

КонецПроцедуры

// D8: клиентский обработчик таймера живости - пересчитывает ЖивостьТекст/
// ЖивостьПодозрениеНаЗависание для строк со Статус = Running по уже
// загруженному в ТЗ LastHeartbeat, без обращения к серверу (см. шапку
// модуля, прецедент ar_ПросмотрЗапуска UI-12).
//
// ТекущаяДата() здесь - клиентское время (платформенный глобальный метод,
// доступный в клиентском контексте), а LastHeartbeat заполняется на сервере
// (ТекущаяДатаСеанса() на момент ar_AuditЗапуски.Heartbeat) - тот же
// компромисс, что уже принят и задокументирован в ar_ПросмотрЗапуска (UI-12,
// см. её ОбновитьHeartbeat): для типовых инсталляций 1С клиент и сервер
// синхронизированы по NTP, расхождение несущественно для индикатора
// "подозрение на зависание" (порог - минуты, не секунды).
//
// Сравнение со статусом Running - через СтатусRunningКэш (закэширован на
// сервере в ПриСозданииНаСервере), а НЕ через "Перечисления.ar_СтатусЗапуска.
// Running" - на клиенте менеджер "Перечисления" не определён (платформа
// отвергает обращение к серверным менеджерам из клиентского контекста).
//
// ВАЖНО (CONS-04, устранено в 0.1.0.306): чтобы этот обработчик вообще
// вызывался, событие OnOpen должно быть ЗАРЕГИСТРИРОВАНО в Form.xml
// (<Event name="OnOpen">ПриОткрытии</Event>). Наличия процедуры ПриОткрытии
// в модуле недостаточно - платформа связывает обработчик с событием через
// XML, а не по имени процедуры. Симптом пропущенной регистрации: таймеры
// молча не подключаются, живость застывает на серверном снимке, при этом
// ни один валидатор и check_1c_code ошибки не показывают.
//
&НаКлиенте
Процедура ПересчитатьЖивость()

	Текущая = ТекущаяДата();
	Для Каждого Строка Из СписокЗапусков Цикл

		Если Строка.Статус <> СтатусRunningКэш Или Не ЗначениеЗаполнено(Строка.LastHeartbeat) Тогда
			Продолжить;
		КонецЕсли;

		ВозрастСек = Цел(Текущая - Строка.LastHeartbeat);
		Если ВозрастСек < 0 Тогда
			ВозрастСек = 0;
		КонецЕсли;

		Строка.ЖивостьТекст = СтрШаблон(НСтр("ru = '%1 сек назад'; en = '%1 sec ago'"),
			Формат(ВозрастСек, "ЧГ=0; ЧДЦ=0; ЧН=0"));

		// D8: Running с устаревшим heartbeat - "подозрение на зависание" до
		// того, как это сделает sweeper (ar_ОчисткаЗависших, SCHED-04).
		Строка.ЖивостьПодозрениеНаЗависание = (HeartbeatПорогСекКэш > 0) И (ВозрастСек > HeartbeatПорогСекКэш);

	КонецЦикла;

КонецПроцедуры

// D9: пересчитывает Сводка.* из ar_КонсольДанные.СводныеСчётчики (тот же
// Отбор, что и у списка - план требует, чтобы сводка соответствовала
// текущему режиму просмотра). ОшибокЗаСутки - отдельный вызов с фиксированным
// периодом "последние сутки" (не зависит от отбора панели, иначе цифра
// "ошибок за сутки" плавала бы вместе с выбранным периодом просмотра).
//
&НаСервере
Процедура ОбновитьСводкуНаСервере(Знач Отбор)

	Счётчики = ar_КонсольДанные.СводныеСчётчики(Отбор);

	СводкаРаботают = 0;
	СводкаЖдутОператора = 0;
	СводкаЗавершено = 0;

	Для Каждого Строка Из Счётчики Цикл
		Если Строка.Статус = Перечисления.ar_СтатусЗапуска.Running
			Или Строка.Статус = Перечисления.ar_СтатусЗапуска.Created Тогда
			СводкаРаботают = СводкаРаботают + Строка.Количество;
		ИначеЕсли Строка.Статус = Перечисления.ar_СтатусЗапуска.PausedForApproval
			Или Строка.Статус = Перечисления.ar_СтатусЗапуска.PausedForInput Тогда
			СводкаЖдутОператора = СводкаЖдутОператора + Строка.Количество;
		ИначеЕсли Строка.Статус = Перечисления.ar_СтатусЗапуска.Completed
			Или Строка.Статус = Перечисления.ar_СтатусЗапуска.Cancelled
			Или Строка.Статус = Перечисления.ar_СтатусЗапуска.DeniedGlobally
			Или Строка.Статус = Перечисления.ar_СтатусЗапуска.FailedIncompatibleState Тогда
			СводкаЗавершено = СводкаЗавершено + Строка.Количество;
		КонецЕсли;
	КонецЦикла;

	СводкаОшибокЗаСутки = ПодсчитатьОшибкиЗаСутки();

	СводкаРаботаютПоле = СтрШаблон(НСтр("ru = 'Работают: %1'; en = 'Running: %1'"), Формат(СводкаРаботают, "ЧГ=0; ЧДЦ=0"));
	СводкаЖдутОператораПоле = СтрШаблон(НСтр("ru = 'Ждут оператора: %1'; en = 'Waiting for operator: %1'"), Формат(СводкаЖдутОператора, "ЧГ=0; ЧДЦ=0"));
	СводкаОшибокЗаСуткиПоле = СтрШаблон(НСтр("ru = 'Ошибок за сутки: %1'; en = 'Errors in 24h: %1'"), Формат(СводкаОшибокЗаСутки, "ЧГ=0; ЧДЦ=0"));
	СводкаЗавершеноПоле = СтрШаблон(НСтр("ru = 'Завершено: %1'; en = 'Completed: %1'"), Формат(СводкаЗавершено, "ЧГ=0; ЧДЦ=0"));

КонецПроцедуры

// Отдельный вызов ar_КонсольДанные.СводныеСчётчики с фиксированным периодом
// "последние сутки" и фильтром по статусу Failed - см. докстроку
// ОбновитьСводкуНаСервере.
//
&НаСервере
Функция ПодсчитатьОшибкиЗаСутки()

	ОтборСутки = Новый Структура;
	ОтборСутки.Вставить("ПериодС", НачалоДня(ТекущаяДатаСеанса() - 24 * 60 * 60));
	ОтборСутки.Вставить("ПериодПо", ТекущаяДатаСеанса());
	ОтборСутки.Вставить("ТолькоСОшибками", Истина);

	Счётчики = ar_КонсольДанные.СводныеСчётчики(ОтборСутки);

	Результат = 0;
	Для Каждого Строка Из Счётчики Цикл
		Результат = Результат + Строка.Количество;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// D9: обновляет строку здоровья планировщика из ar_КонсольДанные.
// ЗдоровьеПланировщика - форма не переизобретает логику диагностики, только
// форматирует уже готовый результат в одну строку ("плашку").
//
&НаСервере
Процедура ОбновитьЗдоровьеНаСервере()

	Диагностика = ar_КонсольДанные.ЗдоровьеПланировщика();

	Части = Новый Массив;
	Для Каждого Элемент Из Диагностика Цикл

		Если Элемент.СекундНазад < 0 Тогда
			ПредставлениеВремени = НСтр("ru = 'не запускался'; en = 'never run'");
		Иначе
			ПредставлениеВремени = СтрШаблон(НСтр("ru = '%1 сек назад'; en = '%1 sec ago'"),
				Формат(Элемент.СекундНазад, "ЧГ=0; ЧДЦ=0"));
		КонецЕсли;

		Части.Добавить(СтрШаблон("%1 %2 (%3)", Элемент.Синоним, ПредставлениеВремени, Элемент.Статус));

	КонецЦикла;

	СтрокаЗдоровья = СтрСоединить(Части, " · ");
	СтрокаЗдоровьяПоле = СтрокаЗдоровья;

КонецПроцедуры

// Текстовое представление длительности запуска - "N сек"/"N мин"/"N ч",
// открытые запуски считаются от старта до текущего момента сеанса.
//
// ВРЕМЕННАЯ ДИАГНОСТИКА (живой прогон 0.1.0.301: колонка "Длительность"
// показывает только суффикс " сек" без числа - т.е. %1 подставился пустой
// строкой, что статическим анализом кода не объясняется - Секунд гарантированно
// Число после Цел()). Если "СтартовалВ не заполнено" тоже показывается в
// колонке - ЗначениеЗаполнено(СтартовалВ) реально Ложь для этой строки,
// несмотря на видимую дату в колонке "Старт" - расхождение источников. Не
// убирать до подтверждения устранения дефекта (см. память проекта
// feedback_keep_debug_logging).
//
&НаСервереБезКонтекста
Функция ПредставлениеДлительности(Знач СтартовалВ, Знач ЗавершенВ)

	Если Не ЗначениеЗаполнено(СтартовалВ) Тогда
		Возврат НСтр("ru = '(СтартовалВ не заполнено)'; en = '(СтартовалВ not filled)'");
	КонецЕсли;

	Конец = ?(ЗначениеЗаполнено(ЗавершенВ), ЗавершенВ, ТекущаяДатаСеанса());
	Секунд = Цел(Конец - СтартовалВ);
	Если Секунд < 0 Тогда
		Секунд = 0;
	КонецЕсли;

	Возврат СтрШаблон(НСтр("ru = '%1 сек'; en = '%1 sec'"), Формат(Секунд, "ЧГ=0; ЧДЦ=0"));

КонецФункции

// Наполняет ChoiceList поля ОтборТриггер известными 6 значениями триггера
// (см. шапку модуля - "Известное ограничение").
//
&НаСервере
Процедура ЗаполнитьChoiceListТриггера()

	Список = Элементы.ОтборТриггер.СписокВыбора;
	Список.Очистить();
	Список.Добавить("manual", НСтр("ru = 'Вручную'; en = 'Manual'"));
	Список.Добавить("schedule", НСтр("ru = 'По расписанию'; en = 'Schedule'"));
	Список.Добавить("mention", НСтр("ru = 'Упоминание'; en = 'Mention'"));
	Список.Добавить("subscription", НСтр("ru = 'Подписка'; en = 'Subscription'"));
	Список.Добавить("http", НСтр("ru = 'HTTP'; en = 'HTTP'"));
	Список.Добавить("dialog", НСтр("ru = 'Диалог'; en = 'Dialog'"));
	Элементы.ОтборТриггер.РежимВыбораИзСписка = Истина;

КонецПроцедуры

// Наполняет реквизит-ТЗ СтатусыОтбора всеми значениями Перечисления.
// ar_СтатусЗапуска (множественный выбор через флажки, план §2.2) - только
// один раз, при первом создании формы (флажки Отмечено не пересоздаются при
// каждом обновлении списка).
//
&НаСервере
Процедура ИнициализироватьСтатусыОтбораНаСервере()

	Если СтатусыОтбора.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ЗначениеСтатуса Из Перечисления.ar_СтатусЗапуска Цикл
		Строка = СтатусыОтбора.Добавить();
		Строка.Статус = ЗначениеСтатуса;
		Строка.Отмечено = Ложь;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
